### Terraform Plan - `dev` Environment

#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret.rds_credentials will be created
  + resource "aws_secretsmanager_secret" "rds_credentials" {
      + arn                            = (known after apply)
      + description                    = "RDS credentials for Medic dev"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "medic/dev/rds-credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags                           = {
          + "Name" = "medic-dev-rds-credentials"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-rds-credentials"
          + "Project"     = "medic"
        }
    }

  # aws_secretsmanager_secret_version.rds_credentials will be created
  + resource "aws_secretsmanager_secret_version" "rds_credentials" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # helm_release.medic will be created
  + resource "helm_release" "medic" {
      + atomic                     = true
      + chart                      = "../../../helm/medic"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "medic"
      + namespace                  = "medic"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = true
    }

  # kubernetes_namespace.medic[0] will be created
  + resource "kubernetes_namespace" "medic" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "environment" = "dev"
              + "managed-by"  = "terraform"
              + "name"        = "medic"
            }
          + name             = "medic"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # null_resource.eso_validation will be created
  + resource "null_resource" "eso_validation" {
      + id = (known after apply)
    }

  # random_password.rds_password will be created
  + resource "random_password" "rds_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.acm.aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "dev-medic.linqapp.com"
      + domain_validation_options = [
          + {
              + domain_name           = "dev-medic.linqapp.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "dev-medic.linqapp.com",
        ]
      + tags                      = {
          + "Name" = "dev-medic.linqapp.com"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dev-medic.linqapp.com"
          + "Project"     = "medic"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.elasticache.aws_elasticache_cluster.this will be created
  + resource "aws_elasticache_cluster" "this" {
      + apply_immediately          = false
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "medic-dev"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.1"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = "mon:04:00-mon:05:00"
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "default.redis7"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_retention_limit   = 0
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "medic-dev-subnet-group"
      + tags                       = {
          + "Name" = "medic-dev"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev"
          + "Project"     = "medic"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # module.elasticache.aws_elasticache_subnet_group.this will be created
  + resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Subnet group for Medic ElastiCache Redis"
      + id          = (known after apply)
      + name        = "medic-dev-subnet-group"
      + subnet_ids  = [
          + "subnet-015236b7bbb9b8a1c",
          + "subnet-036067ac3c7a6e898",
          + "subnet-0faf72d2293694269",
        ]
      + tags        = {
          + "Name" = "medic-dev-subnet-group"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-subnet-group"
          + "Project"     = "medic"
        }
      + vpc_id      = (known after apply)
    }

  # module.elasticache.aws_security_group.redis will be created
  + resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for Medic ElastiCache Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "medic-dev-redis-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "medic-dev-redis-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-redis-sg"
          + "Project"     = "medic"
        }
      + vpc_id                 = "vpc-01a4acd7580a1fb1b"
    }

  # module.elasticache.aws_security_group_rule.redis_egress will be created
  + resource "aws_security_group_rule" "redis_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.elasticache.aws_security_group_rule.redis_ingress_eks will be created
  + resource "aws_security_group_rule" "redis_ingress_eks" {
      + description              = "Allow Redis from EKS nodes"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0b1b54abe7277592c"
      + to_port                  = 6379
      + type                     = "ingress"
    }

  # module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "medic"
      + db_subnet_group_name                  = "medic-dev-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "medic-dev"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Name" = "medic-dev"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev"
          + "Project"     = "medic"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive value)
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Subnet group for Medic RDS PostgreSQL"
      + id                      = (known after apply)
      + name                    = "medic-dev-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-015236b7bbb9b8a1c",
          + "subnet-036067ac3c7a6e898",
          + "subnet-0faf72d2293694269",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "medic-dev-subnet-group"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-subnet-group"
          + "Project"     = "medic"
        }
      + vpc_id                  = (known after apply)
    }

  # module.rds.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for Medic RDS PostgreSQL"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "medic-dev-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "medic-dev-rds-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-rds-sg"
          + "Project"     = "medic"
        }
      + vpc_id                 = "vpc-01a4acd7580a1fb1b"
    }

  # module.rds.aws_security_group_rule.rds_egress will be created
  + resource "aws_security_group_rule" "rds_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.rds.aws_security_group_rule.rds_ingress_eks will be created
  + resource "aws_security_group_rule" "rds_ingress_eks" {
      + description              = "Allow PostgreSQL from EKS nodes"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0b1b54abe7277592c"
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.secrets.aws_iam_policy.secrets_access will be created
  + resource "aws_iam_policy" "secrets_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy allowing Medic to read secrets from Secrets Manager"
      + id               = (known after apply)
      + name             = "medic-dev-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "medic-dev-secrets-policy"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-secrets-policy"
          + "Project"     = "medic"
        }
    }

  # module.secrets.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/79BC393F72D626C3C4A8477CE3A50F1F:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-east-1.amazonaws.com/id/79BC393F72D626C3C4A8477CE3A50F1F:sub" = "system:serviceaccount:medic:medic"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::018143940435:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/79BC393F72D626C3C4A8477CE3A50F1F"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for Medic dev to access Secrets Manager via IRSA"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "medic-dev-secrets-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "medic-dev-secrets-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-secrets-role"
          + "Project"     = "medic"
        }
      + unique_id             = (known after apply)
    }

  # module.secrets.aws_iam_role_policy_attachment.secrets_access will be created
  + resource "aws_iam_role_policy_attachment" "secrets_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "medic-dev-secrets-role"
    }

  # module.secrets.aws_secretsmanager_secret.this will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + description                    = "Application secrets for Medic dev environment"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "medic/dev/secrets"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags                           = {
          + "Environment" = "dev"
          + "Name"        = "medic-dev-secrets"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-secrets"
          + "Project"     = "medic"
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acm_certificate_arn           = (known after apply)
  + acm_validation_records        = {
      + cname_name  = (known after apply)
      + cname_value = (known after apply)
      + domain_name = "dev-medic.linqapp.com"
    }
  + application_url               = "https://dev-medic.linqapp.com"
  + elasticache_connection_string = (known after apply)
  + elasticache_endpoint          = (known after apply)
  + helm_release_name             = "medic"
  + helm_release_status           = "deployed"
  + iam_role_arn                  = (known after apply)
  + namespace                     = "medic"
  + rds_address                   = (known after apply)
  + rds_connection_string         = (sensitive value)
  + rds_database_name             = "medic"
  + rds_endpoint                  = (known after apply)
  + rds_port                      = 5432
  + secrets_arn                   = (known after apply)
  + secrets_name                  = "medic/dev/secrets"

```

</details>

*Pushed by: @unorig-username, Action: `pull_request`*
*Workflow: `Terraform`*